func_task_1

/*Напишите функцию, которая будет принимать число и определять:
 1. Является ли введенное число положительным или отрицательным
 3. Делится ли оно на 2, 5, 3, 6, 9 без остатка
*/


function determineNum(num) {
   if (num <= 0) {
      alert(`число ${num} отрицательное`);
   } else {
      alert(`число ${num} положительное`);
   }
   if (num % 2 == 0) {
      alert(`число ${num} делится без остатка на 2`);
   } else {
      alert(`число ${num} НЕ делится без остатка на 2`);
   }
   if (num % 3 == 0) {
      alert(`число ${num} делится без остатка на 3`);
   } else {
      alert(`число ${num} НЕ делиться без остатка на 3`);
   }
   if (num % 5 == 0) {
      alert(`число ${num} делится без остатка на 5`);
   } else {
      alert(`число ${num} НЕ делится без остатка на 5`);
   }
   if (num % 6 == 0) {
      alert(`число ${num} делится без остатка на 6`);
   } else {
      alert(`число ${num} НЕ делится без остатка на 6`);
   }
   if (num % 9 == 0) {
      alert(`число ${num} делится без остатка на 9`);
   } else {
      alert(`число ${num} НЕ делится без остатка на 9`);
   }
}

determineNum(9);
